** Command Line Interface
#+begin_src shell :results drawer :wrap example :exports both
komb --help
#+end_src

#+RESULTS:
#+begin_example shell
komb - sort JSON & pretty-print

Usage: komb [options] [path]

Reads content of a JSON file from *stdin* if no path provided.

Options:
      --[no-]semantic  true  Enable to preserve order of array elements
      --[no-]pretty    true  Pretty-print the result
  -h, --help                 Print this help.

Arguments:
  path - path to JSON file
#+end_example

